doom-emacs-config.org
#+title: Doom Emacs Literate Configuration
#+author: Minye Zhang
#+auto_tangle: t
#+latex_class: article

The repository represents my attempt to write a literate Emacs configuration on
top of the well-known [[https://github.com/doomemacs/doomemacs][Doom Emacs framework]].
This is my first time to try a literature configuration, but not the first to
tweak Emacs - frustration has beaten me down several times for this seemingly
endless task. I hope I could make more progress.

* Preface
** Why Emacs?
I use Emacs mostly for its fantastic [[https://orgmode.org/][org-mode]].
I got to know Emacs when I started to use [[https://www.orgroam.com/][org-roam]]
to practice Zettelkasten method in 2020.

** Why Doom?
Mostly because I have been using it since the very beginning of my Emacs
journey, as introduced by the org-roam community.  It includes a variety of
batteries. The defaults, although opinionated, suit me well.  I have tried a
couple of times setting my own vanilla Emacs, but I always find something
not that comfortable and don't have enough skills, patience and time to
figure out.  So I decide to continue to use Doom, but improve my current
configuration to adopt myself to the extensive editor and exploit this great
framework.

** How is the configuration written?
Since I have little to none Emacs Lisp skills, most of the codes are either
snippets directly copy-pasted from StackOverflow, r/emacs, EmacsChina or Emacs
configuration repositories of others, or naively adapted from them for my own
use case.  Attention has been carefully paid to credit the source near the
relevant code, but it might be blown out in some frustrated nights.

The idea and organization of this literate configuration follows
[[https://github.com/elken/doom][Elken's]] and
[[https://github.com/tecosaur/emacs-config][tecosaur's]].

* Load pre-defined modules with =init.el=
Input method
#+name: doom-init-input
#+begin_src emacs-lisp
;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
(chinese +rime
         +childframe)
;;japanese
layout            ; auie,ctsrnm is the superior home row
#+end_src

Completion
#+name: doom-init-completion
#+begin_src emacs-lisp
;;(company +auto
;;         +capf)   ; the ultimate code completion backend
;;helm            ; the *other* search engine for love and life
;;ido             ; the other *other* search engine...
;;ivy             ; a search engine for love and life
(vertico +icons)  ; the search engine of the future
#+end_src

UI
#+name: doom-init-ui
#+begin_src emacs-lisp
doom              ; what makes DOOM look the way it does
doom-dashboard    ; a nifty splash screen for Emacs
hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
;;indent-guides     ; highlighted indent columns
(ligatures +extra); ligatures and symbols to make your code pretty again
;;minimap           ; show a map of the code on the side
modeline          ; snazzy, Atom-inspired modeline, plus API
;;nav-flash         ; blink cursor line after big motions
ophints           ; highlight the region an operation acts on
(popup +defaults)   ; tame sudden yet inevitable temporary windows
;;tabs              ; a tab bar for Emacs
treemacs          ; a project drawer, like neotree but cooler
unicode           ; extended unicode support for various languages
(vc-gutter +pretty
           +diff-hl) ; vcs diff in the fringe
vi-tilde-fringe   ; fringe tildes to mark beyond EOB
(window-select +numbers)     ; visually switch windows
workspaces        ; tab emulation, persistence & separate workspaces
#+end_src

Editor
#+name: doom-init-editor
#+begin_src emacs-lisp
(evil +everywhere)  ; come to the dark side, we have cookies
file-templates      ; auto-snippets for empty files
fold                ; (nigh) universal code folding
;;(format +onsave)  ; automated prettiness
multiple-cursors  ; editing in many places at once
;;objed             ; text object editing for the innocent
;;parinfer          ; turn lisp into python, sort of
rotate-text       ; cycle region at point between text candidates
snippets          ; my elves. They type so I don't have to
word-wrap
#+end_src

Tools
#+name: doom-init-tools
#+begin_src emacs-lisp
;;ansible
;;biblio            ; Writes a PhD for you (citation needed)
;;debugger          ; FIXME stepping through code, to help you add bugs
direnv
;;docker
editorconfig        ; let someone else argue about tabs vs spaces
;;ein               ; tame Jupyter notebooks with emacs
(eval +overlay)     ; run code, run (also, repls)
(lookup +docsets)   ; navigate your code and its documentation
(lsp +eglot)        ; M-x vscode
(magit +forge)      ; a git porcelain for Emacs
make                ; run make tasks from Emacs
;;pass              ; password manager for nerds
pdf                 ; pdf enhancements
rgb                 ; creating color strings
;;taskrunner        ; taskrunner for all your projects
;;tmux              ; an API for interacting with tmux
tree-sitter         ; syntax and parsing, sitting in a tree...
upload              ; map local to remote projects via ssh/ftp
#+end_src

Langauge support
#+name: doom-init-lang
#+begin_src emacs-lisp
;;(cc +lsp)         ; C > C++ == 1
;;clojure           ; java with a lisp
data                ; config/data formats
;;elm               ; care for a cup of TEA?
(emacs-lisp +treesitter)       ; drown in parentheses
fortran             ; in FORTRAN, GOD is REAL (unless declared INTEGER)
(json +treesitter)  ; At least it ain't XML
javascript          ; all(hope(abandon(ye(who(enter(here))))))
;;julia             ; a better, faster MATLAB
(latex +latexmk
       +cdlatex)    ; writing papers in Emacs has never been so fun
lua               ; one-based indices? one-based indices
markdown            ; writing docs for people to ignore
;;nix               ; I hereby declare "nix geht mehr!"
;;ocaml             ; an objective camel
(org
     +dragndrop
     +gnuplot
     +contacts
     +ipython
     +jupyter
     +present
     +pretty
     +pandoc
     +noter
     +roam2)        ; organize your plain life in plain text
;;plantuml          ; diagrams for confusing people more
python              ; beautiful is better than ugly
;;qt                ; the 'cutest' gui framework ever
rst               ; ReST in peace
ruby
;;(rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
(sh +zsh)           ; she sells {ba,z,fi}sh shells on the C xor
;;swift             ; who asked for emoji variables?
;;web               ; the tubes
yaml              ; JSON, but readable
#+end_src

Emacs
#+name: doom-init-emacs
#+begin_src emacs-lisp
(dired +icons)    ; making dired pretty [functional]
electric          ; smarter, keyword-based electric-indent
(ibuffer +icons)  ; interactive buffer management
(undo +tree)      ; persistent, smarter undo for your inevitable mistakes
vc                ; version-control and Emacs, sitting in a tree
#+end_src

Terminal support
#+name: doom-init-term
#+begin_src emacs-lisp
;;eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
;;term              ; basic terminal emulator for Emacs
vterm             ; the best terminal emulation in Emacs
#+end_src

Syntax/grammaer checkers
#+name: doom-init-checkers
#+begin_src emacs-lisp
syntax              ; tasing you for every semicolon you forget
(spell +flyspell
       +hunspell)   ; tasing you for misspelling mispelling
grammar             ; tasing grammar mistake every you make
#+end_src

Applications.
#+name: doom-init-app
#+begin_src emacs-lisp
calendar
(rss +org)        ; emacs as an RSS reader
#+end_src

Email functionality. For now I am not using it.
#+name: doom-init-email
#+begin_src emacs-lisp
;;(mu4e +org +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src

General config.
Since the literate config is not named ~config.org~, and ~init.el~ is also literate,
switch on ~literate~ module will lead to error in doom sync.
#+name: doom-init-config
#+begin_src emacs-lisp
;;literate
(default +bindings +smartparens)
#+end_src

Now put them together and tangle to ~init.el~
#+begin_src emacs-lisp :tangle init.el :noweb no-export :results none
;;; init.el -*- lexical-binding: t; -*-
(doom! :input
       <<doom-init-input>>

       :completion
       <<doom-init-completion>>

       :ui
       <<doom-init-ui>>

       :editor
       <<doom-init-editor>>

       :emacs
       <<doom-init-emacs>>

       :term
       <<doom-init-term>>

       :checkers
       <<doom-init-checkers>>

       :tools
       <<doom-init-tools>>

       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       ;;tty               ; improve the terminal Emacs experience

       :lang
       <<doom-init-lang>>

       :email
       <<doom-init-email>>

       :app
       <<doom-init-app>>

       :config
       <<doom-init-config>>
)
#+end_src

* Configuration
